---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNdfType
source: html/2227a9e4-337e-7b10-c68e-8971aa5950fb.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNdfType Property

The property labeled "NDF" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".